# ----------------------------------------------------------------------------------
# **YOOCHOOSE- CLICKS AND BUY - PRE PROCESSING**
# ----------------------------------------------------------------------------------

###### Load Required Package

In [1]:
import os
import pandas as pd

import warnings
warnings.simplefilter('ignore')

###### Define Working Path

In [2]:
path = os.getcwd()
print (path)

/home/machine1/SANDY/web_analytics/CA1_py

In [3]:
clicks_path = path+'/yoochoose-clicks.dat'
buys_path   = path+'/yoochoose-buys.dat'
test_path   = path+'/yoochoose-test.dat'

clicks_spath = path+'/data/clicks_data.csv'
buys_spath   = path+'/data/buys_data.csv'
test_spath   = path+'/data/test_data.csv'

In [4]:
dateparse = lambda x: pd.datetime.strptime(x, '%Y-%m-%dT%H:%M:%S')

# ***Load Required Data***  
#### CLICKS Dataset
The file yoochoose-clicks.dat comprised the clicks of the users over the items.   
Each record/line in the file has the following fields/format: >**Session ID** >**Timestamp** >**Item ID** >**Category**

In [5]:
clicks_data = pd.read_csv( clicks_path,
                           delimiter=',',
                           header=None,
                           names=['session_id', 'datetime', 'item_id', 'category'],
                           dtype={'session_id':int, 'item_id':int, 'category':str},
                           parse_dates=['datetime'],
                           date_parser=dateparse).sort_values(by=['datetime','session_id'],ascending=True).reset_index(drop=True)

Replace [Brand] category indentifiers with a digit 13 in catergory column   
Replace [Special offer] Category indentifiers with a digit 14 in catergory column

In [6]:
clicks_data.category[clicks_data.category.apply(len) > 2] = '13'
clicks_data.category[clicks_data.category == 'S'] = '14'
clicks_data['category'] = clicks_data['category'].astype('int')

In [7]:
print("----------------------------------------------------------")
print("Summary of the basic information about yoochoose-clicks data")
print("----------------------------------------------------------")
clicks_data.info()

----------------------------------------------------------
Summary of the basic information about yoochoose-clicks data
----------------------------------------------------------
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 33003944 entries, 0 to 33003943
Data columns (total 4 columns):
session_id    int64
datetime      datetime64[ns]
item_id       int64
category      int64
dtypes: datetime64[ns](1), int64(3)
memory usage: 1007.2 MB

Remove duplicate records

In [8]:
clicks_data = clicks_data.drop_duplicates(subset=['session_id',"datetime","item_id","category"],keep="last").sort_values(by=['datetime','session_id'],ascending=True).reset_index(drop=True)

Total number of records

In [9]:
len(clicks_data)

33003876

Different type of categories

In [10]:
clicks_data.category.sort_values().unique().tolist()

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14]

Total number of items

In [11]:
len(clicks_data.item_id.sort_values().unique().tolist())

52739

Total number of unique sessions

In [12]:
len(clicks_data.session_id.sort_values().unique().tolist())

9249729

In [13]:
clicks_data.head()

   session_id                datetime    item_id  category
0      351646 2014-04-01 03:00:00.124  214717005         0
1      389654 2014-04-01 03:00:00.567  214826705         0
2      263073 2014-04-01 03:00:10.087  214716982         0
3      210798 2014-04-01 03:00:13.070  214581827         0
4      375257 2014-04-01 03:00:13.768  214644307         0

#### BUY Dataset
The file yoochoose-buy.dat comprised the clicks of the users over the items.  
Each record/line in the file has the following fields/format: >**Session ID** >**Timestamp** >**ItemID** >**Price** >**Quantity**

In [14]:
buys_data = pd.read_csv( buys_path,
                         delimiter=',',
                         header=None,
                         names=['session_id', 'datetime', 'item_id', 'price', 'quantity'],
                         dtype={'session_id':int, 'item_id':int, 'price':int, 'quantity':int},
                         parse_dates=['datetime'],
                         date_parser=dateparse).sort_values(by=['datetime','session_id'],ascending=True).reset_index(drop=True)

In [15]:
buys_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1150753 entries, 0 to 1150752
Data columns (total 5 columns):
session_id    1150753 non-null int64
datetime      1150753 non-null datetime64[ns]
item_id       1150753 non-null int64
price         1150753 non-null int64
quantity      1150753 non-null int64
dtypes: datetime64[ns](1), int64(4)
memory usage: 43.9 MB

Top five unique return by value in increasing Order. [Quantity]

In [16]:
buys_data.quantity.sort_values().unique()[0:5].tolist()

[0, 1, 2, 3, 4]

Top five unique return by value in increasing Order.  [Price]

In [15]:
buys_data.price.sort_values().unique()[0:5].tolist()

[0, 26, 37, 47, 51]

Transaction data contents [0] value quantity and [0] value price which maybe because of data collection error. Those rows should be remove because they are not useful for analysis.

In [18]:
len(buys_data.loc[(buys_data['price'] != 0) & (buys_data['quantity'] != 0)])

540723

In [19]:
buys_data = buys_data.loc[(buys_data['price'] != 0) & (buys_data['quantity'] != 0)]

In [20]:
buys_data = buys_data.sort_values(by=['datetime','session_id'],ascending=True).reset_index(drop=True)

Remove duplicate records

In [21]:
buys_data = buys_data.drop_duplicates(subset=['session_id',"datetime","item_id","price","quantity"],keep="last").sort_values(by=['datetime','session_id'],ascending=True).reset_index(drop=True)

In [22]:
buys_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 540720 entries, 0 to 540719
Data columns (total 5 columns):
session_id    540720 non-null int64
datetime      540720 non-null datetime64[ns]
item_id       540720 non-null int64
price         540720 non-null int64
quantity      540720 non-null int64
dtypes: datetime64[ns](1), int64(4)
memory usage: 20.6 MB

In [23]:
buys_data.head()

   session_id                datetime    item_id  price  quantity
0      263073 2014-04-01 03:05:31.743  214716982   2617         1
1      466654 2014-04-01 03:21:30.255  214820812    313         1
2      466654 2014-04-01 03:21:30.271  214584907   4711         1
3      185089 2014-04-01 03:29:09.230  214819376    418         1
4      185089 2014-04-01 03:29:09.280  214819430    418         1

#### BUY merge CLICK Dataset
We merged click data with click dataset on session id and item id.   
Each record/line in the file has the following fields/format: >**x.Session ID** >**x.Timestamp** >**x.ItemID** >**x.Price** >**x.Quantity** >**y.Date time** >>**y.category**  
We then sort the click colunm time stamp in decreasing order.

In [69]:
merge_data = pd.merge( buys_data, clicks_data,
                       how='left',on=['session_id','item_id'])

In [70]:
merge_data.head()

,session_id,datetime_x,item_id,price,quantity,datetime_y,category
0,263073,2014-04-01 03:05:31.743,214716982,2617,1,2014-04-01 03:00:10.087,0
1,263073,2014-04-01 03:05:31.743,214716982,2617,1,2014-04-01 03:01:07.619,0
2,263073,2014-04-01 03:05:31.743,214716982,2617,1,2014-04-01 03:01:42.898,0
3,466654,2014-04-01 03:21:30.255,214820812,313,1,2014-04-01 03:14:00.623,0
4,466654,2014-04-01 03:21:30.271,214584907,4711,1,2014-04-01 03:06:12.148,0

In [71]:
merge_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1042208 entries, 0 to 1042207
Data columns (total 7 columns):
session_id    1042208 non-null int64
datetime_x    1042208 non-null datetime64[ns]
item_id       1042208 non-null int64
price         1042208 non-null int64
quantity      1042208 non-null int64
datetime_y    1042208 non-null datetime64[ns]
category      1042208 non-null int64
dtypes: datetime64[ns](2), int64(5)
memory usage: 63.6 MB

In [72]:
buys_click_data = merge_data.drop_duplicates(subset=['session_id',"datetime_x","item_id","price","quantity"],keep="last").sort_values(by=['datetime_x','session_id'],ascending=True).reset_index(drop=True)

In [73]:
buys_click_data.head()

,session_id,datetime_x,item_id,price,quantity,datetime_y,category
0,263073,2014-04-01 03:05:31.743,214716982,2617,1,2014-04-01 03:01:42.898,0
1,466654,2014-04-01 03:21:30.255,214820812,313,1,2014-04-01 03:14:00.623,0
2,466654,2014-04-01 03:21:30.271,214584907,4711,1,2014-04-01 03:07:51.197,0
3,185089,2014-04-01 03:29:09.230,214819376,418,1,2014-04-01 03:05:00.662,0
4,185089,2014-04-01 03:29:09.280,214819430,418,1,2014-04-01 03:09:23.205,0

In [74]:
buys_click_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 540720 entries, 0 to 540719
Data columns (total 7 columns):
session_id    540720 non-null int64
datetime_x    540720 non-null datetime64[ns]
item_id       540720 non-null int64
price         540720 non-null int64
quantity      540720 non-null int64
datetime_y    540720 non-null datetime64[ns]
category      540720 non-null int64
dtypes: datetime64[ns](2), int64(5)
memory usage: 28.9 MB

#### Test (Click) Dataset
The file yoochoose-test.dat comprised the clicks of the users over the items.   
Each record/line in the file has the following fields/format: >**Session ID** >**Timestamp** >**Item ID** >**Category**

In [30]:
test_data = pd.read_csv(   test_path,
                           delimiter=',',
                           header=None,
                           names=['session_id', 'datetime', 'item_id', 'category'],
                           dtype={'session_id':int, 'item_id':int, 'category':str},
                           parse_dates=['datetime'],
                           date_parser=dateparse).sort_values(by=['datetime','session_id'],ascending=True).reset_index(drop=True)

In [31]:
#Replace [Brand] category indentifiers with a digit 13 in catergory column
test_data.category[test_data.category.apply(len) > 2] = '13'
#Replace [Special offer] Category indentifiers with a digit 14 in catergory column
test_data.category[test_data.category == 'S'] = '14'
test_data['category'] = test_data['category'].astype('int')

In [32]:
test_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8251791 entries, 0 to 8251790
Data columns (total 4 columns):
session_id    int64
datetime      datetime64[ns]
item_id       int64
category      int64
dtypes: datetime64[ns](1), int64(3)
memory usage: 251.8 MB

Remove duplicate records

In [34]:
test_data = test_data.drop_duplicates(subset=['session_id',"datetime","item_id","category"],keep="last").sort_values(by=['datetime','session_id'],ascending=True).reset_index(drop=True)
len(test_data)

8251778

List all categories

In [35]:
test_data.category.sort_values().unique().tolist()

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14]

Total number of items

In [36]:
len(test_data.item_id.sort_values().unique().tolist())

42155

Total number of unique session

In [37]:
len(test_data.session_id.sort_values().unique().tolist())

2312432

In [38]:
print("----------------------------------------------------------")
print("Summary of the basic information about yoochoose-test data")
print("----------------------------------------------------------")
test_data.info()

----------------------------------------------------------
Summary of the basic information about yoochoose-test data
----------------------------------------------------------
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8251778 entries, 0 to 8251777
Data columns (total 4 columns):
session_id    int64
datetime      datetime64[ns]
item_id       int64
category      int64
dtypes: datetime64[ns](1), int64(3)
memory usage: 251.8 MB

In [39]:
test_data.head()

   session_id                datetime    item_id  category
0       23675 2014-04-01 03:00:08.250  214842345         0
1      123545 2014-04-01 03:00:17.603  214717003         0
2       23675 2014-04-01 03:00:31.643  214639372         0
3       40525 2014-04-01 03:00:32.008  214684320         0
4       23675 2014-04-01 03:00:44.712  214591470         0

# Export datasets to csv

In [42]:
clicks_data.to_csv(clicks_spath, encoding='utf-8', index=False)
buys_data.to_csv(buys_spath, encoding='utf-8', index=False)
test_data.to_csv(test_spath, encoding='utf-8', index=False)

In [44]:
bc_spath = path+'/data/buys_click_data.csv'
buys_click_data.to_csv(bc_spath, encoding='utf-8', index=False)

# -------------------------------------------------------------

In [76]:
buys_click_data.head()

,session_id,datetime_x,item_id,price,quantity,datetime_y,category
0,263073,2014-04-01 03:05:31.743,214716982,2617,1,2014-04-01 03:01:42.898,0
1,466654,2014-04-01 03:21:30.255,214820812,313,1,2014-04-01 03:14:00.623,0
2,466654,2014-04-01 03:21:30.271,214584907,4711,1,2014-04-01 03:07:51.197,0
3,185089,2014-04-01 03:29:09.230,214819376,418,1,2014-04-01 03:05:00.662,0
4,185089,2014-04-01 03:29:09.280,214819430,418,1,2014-04-01 03:09:23.205,0

In [77]:
buys_click_data_tran = buys_click_data.ix[:,[0,5,2,6]]

In [79]:
buys_click_data_tran = buys_click_data_tran.sort_values(by=['datetime_y','session_id'],ascending=True).reset_index(drop=True)

In [80]:
buys_click_data_tran.head()

   session_id              datetime_y    item_id  category
0      263073 2014-04-01 03:01:42.898  214716982         0
1      185089 2014-04-01 03:05:00.662  214819376         0
2      185089 2014-04-01 03:07:12.199  214716667         0
3      466654 2014-04-01 03:07:51.197  214584907         0
4      185089 2014-04-01 03:09:23.205  214819430         0

In [81]:
tran_spath = path+'/data/buys_click_data_tran.csv'

In [82]:
buys_click_data_tran.to_csv(tran_spath, encoding='utf-8', index=False)

In [85]:
buys_click_data_tran3 = buys_click_data.ix[:,[0,1,2]]
buys_click_data_tran3 = buys_click_data_tran3.sort_values(by=['datetime_x','session_id'],ascending=True).reset_index(drop=True)

In [86]:
buys_click_data_tran3.head()

   session_id              datetime_x    item_id
0      263073 2014-04-01 03:05:31.743  214716982
1      466654 2014-04-01 03:21:30.255  214820812
2      466654 2014-04-01 03:21:30.271  214584907
3      185089 2014-04-01 03:29:09.230  214819376
4      185089 2014-04-01 03:29:09.280  214819430

In [87]:
tran3_spath = path+'/data/buys_click_data_tran3.csv'
buys_click_data_tran3.to_csv(tran3_spath, encoding='utf-8', index=False)

# -------------------------------------------------------------